app/controllers/products_controller.rb

INSERT INTO "products" ("name", "vulnerability", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["vulnerability", ""], ["created_at", "2015-04-21 19:36:22.851970"], ["updated_at", "2015-04-21 19:36:22.851970"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "document_updated_at" = ?, "document_file_name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["document_updated_at", "2015-07-13 09:56:46.859313"], ["document_file_name", "-Design_Patterns-_in_Ruby_Presentation.pdf"], ["updated_at", "2015-07-13 09:56:46.882070"], ["id", 34]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)