app/controllers/vulnerabilities_controller.rb

  def new
    @product       = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 59]]

  def update
    with_known_vulnerability do
    	respond_to do |format|
        if @vulnerability.update(vulnerability_params)
---
UPDATE "vulnerabilities" SET "issue" = ?, "severity" = ?, "remediation" = ?, "updated_at" = ? WHERE "vulnerabilities"."id" = ?  [["issue", "test"], ["severity", "test"], ["remediation", "test"], ["updated_at", "2015-05-06 14:49:17.947818"], ["id", 18]]

 def create
   @product       = Product.find(params[:product_id])
   @vulnerability = @product.vulnerabilities.create!(vulnerability_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "vulnerabilities" ("issue", "severity", "remediation", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["issue", ""], ["severity", ""], ["remediation", ""], ["product_id", 6], ["created_at", "2015-04-21 21:18:41.466587"], ["updated_at", "2015-04-21 21:18:41.466587"]]