app/controllers/vulnerabilities_controller.rb

  def resolve
    with_known_vulnerability do
      @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 34]]