app/controllers/vulnerabilities_controller.rb

  def resolve
    with_product do
      @vulnerability = Vulnerability.find(params[:id])
---
SELECT  "vulnerabilities".* FROM "vulnerabilities" WHERE "vulnerabilities"."id" = ? LIMIT 1  [["id", 27]]